const items = [
    {
        "image": './images/black-heart.png',
        "titel": 'Фонтанчик-автопоилка для питомцев "Хрустальный ручей"',
        "description": 'В жаркую погоду очень важно много пить, чтобы не перегреться. Люди могут полакомиться мороженым, освежитья лимонадом, а животные... Фонтанчик "Хрустальный ручей" будет помощником вашим любимым питомцам, который всегда будет готов поделиться живительной влагой.',
        "price": '70',
        "src": '../global-images/for-cards/water-pet-fontain.jpeg',
        "cardRating": '4.6',
        "category": ["dog", "cat"],
        "id": '1',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Фонтанчик-автопоилка для питомцев "Живая вода"',
        "description": 'Все мы, люди, тянемся к разнообразию. Животным тоже не хватает чудес в жизни, особенно если они целый день дома. Подарите им капельку разнообразия с автопоилкой "Живая вода". С нею им всегда будет интересно посещать вашу кухню...',
        "price": '75',
        "src": '../global-images/for-cards/drinking-fontain-for-pets.jpg',
        "cardRating": '4.8',
        "category": ["dog", "cat"],
        "id": '2',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Фонтанчик-автопоилка для питомцев "Изумрудный прибой"',
        "description": 'Кто не любит ездить на море? А часто вы берёте с собой своих домашних питомцев? Может наши домашние любимчики никогда не увидят моря... Подарите им кусочек моря с автопоилкой-фонтанчиком "Изумрудный прибой".',
        "price": '72',
        "src": '../global-images/for-cards/water-pet-fontain-3.jpeg',
        "cardRating": '4.4',
        "category": ["dog", "cat"],
        "id": '3',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Автоматическая кормушка для питомцев "Чашка-волшебница"',
        "description": 'Горшочек каши — волшебная сказка для детей всех возрастов, записанная братьями Гримм. "Чашка-волшебница" - это чародейный горшочек с кормом для питомцев, который всегда по-расписанию насыпет корм и проконтролирует, чтобы ваш любимец не переел.',
        "price": '64',
        "src": '../global-images/for-cards/automatic-feeder.jpg',
        "cardRating": '3.6',
        "category": ["cat", "dog"],
        "id": '4',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Автоматическая кормушка для питомцев "MealMaster"',
        "description": '"MealMaster" - это умная автоматическая кормушка, которая знает, когда ваш питомец ел, пил, сколько раз в день он подходил и просился поесть. Вам больше не нужно думать, кому отдать любимца на время отъезда.',
        "price": '62',
        "src": '../global-images/for-cards/automatic-feeder-with-camera.jpg',
        "cardRating": '3.1',
        "category": ["cat", "dog"],
        "id": '5',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Автоматический лоток для котов "Кошачий офис"',
        "description": 'Лоток, максимально быстро удаляющий все запахи и следы. Ваш дом всегда останется чистым и ухоженным. Не забывайте почаще менять фильтр - и наслаждайтесь.',
        "price": '63',
        "src": '../global-images/for-cards/automatic-tray.jpg',
        "cardRating": '5.0',
        "category": ["cat"],
        "id": '6',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Автоматический лоток для котов "DiamondLitter"',
        "description": 'Удалит все последствия и запахи за считанные секунды. Приучите кота к новому месту - и радуйтесь чистым полу и ковру.',
        "price": '72',
        "src": '../global-images/for-cards/automatic-tray-1.jpeg',
        "cardRating": '4.2',
        "category": ["cat"],
        "id": '7',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Автоматический лоток для котов "PlatinumCat"',
        "description": 'Очень мягкий внутри, не пропускает запахи, не требует от вас никаких вмешательств кроме очистки фильтра - идеальный вариант для любого дома. ',
        "price": '81',
        "src": '../global-images/for-cards/automatic-tray-2.jpg',
        "cardRating": '3.6',
        "category": ["cat"],
        "id": '8',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Автоматический лоток для котов "GoldLitter"',
        "description": 'С таким чудом техники все остануться довольны: и вы, и пол, и ковёр, и кот. Очищайте фильтр почаще и наблюдайте, как в вашем доме работает магия чистоты.',
        "price": '77',
        "src": '../global-images/for-cards/automatic-tray-3.png',
        "cardRating": '4.5',
        "category": ["cat"],
        "id": '9',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Автоматический лоток для котов "Персональный трон Его Величества Кота"',
        "description": 'С таким троном и полу, и ковру, и абсолютно любой мебели бояться больше нечего. И его величеству приятно и интересно, и хозяевам спокойно и уютно.',
        "price": '68',
        "src": '../global-images/for-cards/automatic-tray-4.jpg',
        "cardRating": '5.0',
        "category": ["cat"],
        "id": '10',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Автоматический лоток для котов "Фабрика чистоты"',
        "description": 'Наша фабрика чистоты оперативно проведёт профилактику и создаст идеальные условия для того, чтобы в вашем доме на неделю не заботились ни о полу, ни о коврах, ни о мебели.',
        "price": '78',
        "src": '../global-images/for-cards/automatic-tray-5.jpg',
        "cardRating": '3.3',
        "category": ["cat"],
        "id": '11',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Тёплая клетка для птиц "Зимний очаг"',
        "description": 'Тёплая клетка для птиц "Зимний очаг" с функцией самонагрева создана для гостей юга, живущих в людных районах, где местного отопления им бывает недостатаочно. Вы когда-нибудь видели своего питомца дрожащим от холода? Наша клетка уже ждёт вас.',
        "price": '88',
        "src": '../global-images/for-cards/warm-bird-feeder-1.jpeg',
        "cardRating": '5.0',
        "category": ["bird"],
        "id": '12',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Тёплая клетка для птиц "Тёплая зима"',
        "description": 'Давайте позаботимся о братьях наших меньших вместе. Клетка с самоотоплением "Золотой очаг" ждёт своего хозяина, чтобы обогреть в чьём-то саду или дворе маленькие пернатые комочки.',
        "price": '92',
        "src": '../global-images/for-cards/warm-bird-feeder-2.jpeg',
        "cardRating": '4.9',
        "category": ["bird"],
        "id": '13',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Тёплая кормушка для птиц "Зимний курорт "Пернатый рай"',
        "description": '"Зимний курорт "Пернатый рай" - уютный домик-кормушка с подогревом для зимующих птичек. Если вы не равнодушны к своим друзьям, которые весной радуют нас своими ранними трелями, то вы можете сделать им очень полезный подарок.',
        "price": '90',
        "src": '../global-images/for-cards/warm-bird-feeder-4.jpeg',
        "cardRating": '4.7',
        "category": ["bird"],
        "id": '14',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Тёплая крмушка для птиц "Лучик юга"',
        "description": 'Не для кого не секрет, что многие птицы улетают на юг с приходом осени. А есть птички, которые остаются дома и вынуждены переживать лютый мороз и страшный голод. Давайте поможем им вместе с кормушкой с самообогревом "Уголок юга"',
        "price": '86',
        "src": '../global-images/for-cards/warm-bird-feeder-5.jpeg',
        "cardRating": '4.3',
        "category": ["bird"],
        "id": '15',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Тёплая кормушка для птиц "Зиминий оазис"',
        "description": 'Вы любите животных, но у вас нет возможности завести домашнего питомца? Это не беда. С кормушкой с функцией самообогрева "Зимний оазис" вы можете поделиться своей теплотой и любовью с зимующими птичками, не приводя их к себе домой.',
        "price": '82',
        "src": '../global-images/for-cards/warm-bird-feeder-6.jpeg',
        "cardRating": '4.9',
        "category": ["bird"],
        "id": '16',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Тёплая кормушка для птиц "Клуб зимних птиц"',
        "description": 'Представляем Вашему вниманию новый технологичный отель для зимующих братьев наших меньших с функцией самообогрева, который ищет своего владельца. Спешите приобрести раскошную зимнюю кормушку и помочь нашим друзьям-птичкам.',
        "price": '85',
        "src": '../global-images/for-cards/warm-bird-feeder-7.jpeg',
        "cardRating": '5.0',
        "category": ["bird"],
        "id": '17',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Тёплая клетка для птиц "Теплое местечко"',
        "description": 'Бывает так, что стало холодно, а отопление ещё не дали. И когда люди могут надеть тёплый свитер и заварить чашечку чая, наши пернатые питомцы с юга вынждены дрожать от холода. С самообогревающейся клеткой "Тёплое местечко" ваши любимцы всегда будут в тепле и уюте.',
        "price": '83',
        "src": '../global-images/for-cards/warm-bird-feeder-8.jpeg',
        "cardRating": '4.0',
        "category": ["bird"],
        "id": '18',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Ошейник для собак с ультразвуком "Цитадель"',
        "description": 'Когда мы идём в лес, то одеваем толстую одежду, берём с собой спреи от насекомых, всячески предохраняемся от укусов клещей. А у наших четверолапых друзей нет такой защиты. Но вы всегда можете им помочь с ошейником с ультразвуком "Цитадель"',
        "price": '50',
        "src": '../global-images/for-cards/leaf-protection-from-insects-for-dogs.jpeg',
        "cardRating": '5',
        "category": ["dog"],
        "id": '19',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Дорожная поилка для питомцев "Дорожная Роса"',
        "description": 'Важно в путешествие брать с собой бутылочку воды - всегда пригодится. А что же нашим любимым питомца, сопровождающим Вас в пути? Представляем Вам экономную дорожную поилку для животных "Дорожная роса", которая всегда пригодится в длительном путешествии.',
        "price": '10',
        "src": '../global-images/for-cards/travel-drinker-for-animals.png',
        "cardRating": '3.8',
        "category": ["dog", "cat"],
        "id": '20',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Проектор джунглейй для детей и тропических животных "Дикая Вселенная"',
        "description": '"Дикая Вселенная" - это классный проектор джунглейй, который в считанные секунды превратит вашу комнату в тропический лес. Будет приятно сделать такой подарок как экваториальным питомцам, так и маленьким детишкам.',
        "price": '15',
        "src": '../global-images/for-cards/spotlight-jungle-2.jpeg',
        "cardRating": '3.1',
        "category": ["bird", "unique"],
        "id": '21',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Проектор джунглейй для детей и тропических животных "Джунгли в объективе"',
        "description": 'Бывало ли так, что вам кажется, что домашние питомцы из тропиков скучают по своему дому?.. Подарите им уголок их родного дома, а также порадуйте своих детей с проектором джунглей "Джунгли в объективе."',
        "price": '12',
        "src": '../global-images/for-cards/spotlight-jungle-3.jpeg',
        "cardRating": '3.0',
        "category": ["bird", "unique"],
        "id": '22',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная миска-весы для животных "СмартПитание"',
        "description": 'Бывало ли у вас такое, что вы перекармливали своих любимых питомцев? Может сейчас у них есть избыточный вес и ветеринары рекомендуют им сесть на диету? Здоровью питомца может помочь умная миска-весы "СмартПитание", которая не даст вам перекормить любимца.',
        "price": '58',
        "src": '../global-images/for-cards/smart-weight-1.jpeg',
        "cardRating": '4.9',
        "category": ["dog", "cat"],
        "id": '23',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная миска-весы для животных "Кормилка IQ"',
        "description": '"Кормилка IQ" - это умная миска-весы для домашних животных. Она предупредит вас звуковым сигналом о том, что порция превышает суточную норму и не даст вашему любимцу слишком набрать вес. Вы можете настроить миску для своего питомца и больше не бояться. что преборщите с кормом.',
        "price": '55',
        "src": '../global-images/for-cards/smart-weight-2.jpeg',
        "cardRating": '4.6',
        "category": ["dog", "cat"],
        "id": '24',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная миска-весы для питомца "Здоровый Животик"',
        "description": 'Чтобы ваши питомцы оставались весёлыми и подвижными, предлагаем вам миску-весы "Здоровый Животик". Теперь вы никогда не преборщите с кормом: наша миска всегда предупредит звуковым сигналом во имя здоровья вашего любимца.',
        "price": '56',
        "src": '../global-images/for-cards/smart-weight-3.jpeg',
        "cardRating": '4.2',
        "category": ["cat", "dog"],
        "id": '25',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная миска-весы для питомца "Мой маленький Пухляш"',
        "description": 'Умная миска-весы для питомца "Мой маленький пухляш" подойдёт питомцам, которым ветеринары прописывают строгую слежку за рационом дня. Введи параметры для своего любимца, и звуковой датчик будет предупреждать вас о норме.',
        "price": '48',
        "src": '../global-images/for-cards/smart-weight-4.jpeg',
        "cardRating": '3.8',
        "category": ["dog", "cat"],
        "id": '26',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная миска-весы для питомца "Растём не вширь"',
        "description": '"Растём не вширь" - умная миска-весы для хозяев, которые насыпают корма своим любимцам на глаз и зачастую перекармливают их. Данное устройство предупрелит вас о превышении суточной нормы и сохранит лёгкость и стройность вашему любимцу.',
        "price": '49',
        "src": '../global-images/for-cards/smart-weight-5.jpeg',
        "cardRating": '4.3',
        "category": ["dog", "cat"],
        "id": '27',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная миска-весы для питомца "Мой дорогой тюленьчик"',
        "description": 'Белые медведи, моржи и тюлени запасают жир, чтобы не замёрзнуть в вечных льдах. Но ваш четверолапый друг на Северный или Южный Полюс не собирается и ему, в отличие от жильцов льдов, нужно следить за рационом. Умная миска-весы "Мой маленький тюленьчик" поможет ему в этом.',
        "price": '51',
        "src": '../global-images/for-cards/smart-weight-6.jpeg',
        "cardRating": '4.6',
        "category": ["dog", "cat"],
        "id": '28',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный террариум для маленьких рептилий "ЭкоТерра"',
        "description": 'По статистике, большинство владельцем домашних животных заводят собаку, котика, рыбку, птичку... А что делать любителям экзотики? Умный террариум "ЭкоТерра" - ваш верный помощник по уходу и содержанием маленьких рептилий.',
        "price": '112',
        "src": '../global-images/for-cards/smart-terrarium-for-very-small-reptiles-3.jpeg',
        "cardRating": '4.8',
        "category": ["unique"],
        "id": '29',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный террариум для маленьких рептилий "РептоДом"',
        "description": 'не на каждом углу встретишь правила ухода за экзотическими животными... "РептоДом" - умный террариум для маленьких рептилий с искусственной регуляцией освещения и влажности - ваш лучший друг в этом деле.',
        "price": '110',
        "src": '../global-images/for-cards/smart-terrarium-for-very-small-reptiles-4.jpeg',
        "cardRating": '4.4',
        "category": ["unique"],
        "id": '30',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный террариум для маленьких рептилий "ТерраНеон"',
        "description": '"ТерраНеон" - это умный террариум с функциями искусственного регулирования света, температуры, влыжности, который реагирует на изменения в поведении вашего необычного питомца и старается максимально подстроиться под него.',
        "price": '120',
        "src": '../global-images/for-cards/smart-terrarium-for-very-small-reptiles-5.jpeg',
        "cardRating": '5.0',
        "category": ["unique"],
        "id": '31',
        "numm": '0',
    }, {
        "image": './images/black-heart.png',
        "titel": 'Умный террариум для маленьких рептилий "РептоКрай"',
        "description": 'Новый дом для вашего уникального домашнего животного "РептоКрай" со всеми возможными и невозможными удобствами ждёт своего владельца, чтобы подарить маленьким рептилиям кусочек родного уголка.',
        "price": '118',
        "src": '../global-images/for-cards/smart-terrarium-for-very-small-reptiles-6.jpeg',
        "cardRating": '4.9',
        "category": ["unique"],
        "id": '32',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный дом для питомца с фукцией регулировки температуры "КомфортХаус"',
        "description": 'Животные отлично подмечают перемену температуры. Как-никак, а любой дом, если его не отапливать, когда-нибудь остынет. Давайте подарим нашим любимцам домик "КомфортХаус", который сам нагреется, если станет холодно.',
        "price": '140',
        "src": '../global-images/for-cards/smart-temperature-house.jpeg',
        "cardRating": '5.0',
        "category": ["cat", "dog"],
        "id": '33',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная миска с регулированием температуры "Горячий пёс / Холодный кот"',
        "description": 'Умная миска "Горячий пёс / Холодный кот" - универсальное решение для любой температуры: в холодный день еда вашего питомца останется тёплой, а в жаркий - не перегреется.',
        "price": '36',
        "src": '../global-images/for-cards/smart-temperature-feeder.png',
        "cardRating": '4.8',
        "category": ["dog", "cat"],
        "id": '34',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный змеиный трекер "Глаз Змеи"',
        "description": 'Владельцы домашних питомцев-змей, вам никогда не было интересно, чем занимается ваш любимец в ваше отсутствие? Всё ли с ним хорошо? Наш умный змеиный трекер "Глаз Змеи" проследит за вашей рептилией и даст рекомендации по уходу за ней.',
        "price": '140',
        "src": '../global-images/for-cards/smart-snake-trecker.jpeg',
        "cardRating": '3.6',
        "category": ["unique"],
        "id": '35',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный змеиный трекер "Кобра-Тек"',
        "description": 'Если вам кажется, что ваш питомец заболел, а вы не знаете что делать и куда обратится -  умный змеиный трекер "Кобра-Тек" для вас. Он поможет вам в профилакте заболеваний: даст рекомендации по уходу и проследит за вашей змеёй. Но всё-таки рекомендуем обратится к ветеринару!',
        "price": '138',
        "src": '../global-images/for-cards/smart-snake-trecker-2.jpeg',
        "cardRating": '4.2',
        "category": ["unique"],
        "id": '36',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный лабиринт для грызунов "Лабиринт виллы Пизани"',
        "description": 'Ваш грызун невероятно активен, но ему негде разгуляться? Представляем вашему вниманию уникальный умный лабиринт "Лабиринт виллы Пизани". Ваш зверёк никогда не соскучиться: каждый день его будут ждать новые тунели и препятствия, новые испытания, ловушки и двигающиеся проходы!',
        "price": '75',
        "src": '../global-images/for-cards/smart-rodent-maze.jpeg',
        "cardRating": '5',
        "category": ["maze"],
        "id": '37',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная кормушка-весы для грызунов "Кормушка-Толстушка"',
        "description": 'Очень опасно перекармливать любое животное, особенно если это грызун! Зверёк должен хорошо двигаться и здорово питаться. "Кормушка-Толстушка" не даст вам перекормит своего зверька, чтобы он всегда оставался весёлым и ловким.',
        "price": '32',
        "src": '../global-images/for-cards/smart-rodent-feeder-1.jpeg',
        "cardRating": '3.9',
        "category": ["maze"],
        "id": '38',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная кормушка-весы для грызунов "Баланс Байта"',
        "description": 'С маленькими грызунами сложно знать меру: ты только дал им корм, а они уже всё схлопали, а если это хомяк, то и за щёки себе засунули - про запас. Кормущка весы "Баланс Байта" сама запомнит, кормили ли вы питомца или нет и поможет знать меру. Просто установите нужные параметры - и готово.',
        "price": '36',
        "src": '../global-images/for-cards/smart-rodent-feeder-2.jpeg',
        "cardRating": '4.0',
        "category": ["maze"],
        "id": '39',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная кормушка-весы для грызунов "Ма́ат"',
        "description": 'Ма́ат -  древнеегипетская богиня истины, справедливости, закона и миропорядка, которая руководит звёздами, временами года, восходами и закатами солнца. Теперь у неё появится ещё одна задача - оберегать вашего грызуна от переедания.',
        "price": '41',
        "src": '../global-images/for-cards/smart-rodent-feeder_5.jpeg',
        "cardRating": '5',
        "category": ["maze"],
        "id": '40',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная тарелка-весы для грызунов "Коэус"',
        "description": ' В древнегречейской мифологии Коэус - бог разума и небесная ось, вокруг которой вращались созвездия. Теперь он будет разумно подходить к рациону вашего питомца и сообщать звуковыми сигналами о передозировке корма.',
        "price": '42',
        "src": '../global-images/for-cards/smart-rodent-feeder-6.jpeg',
        "cardRating": '5',
        "category": ["maze"],
        "id": '41',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная кормушка-весы для грызунов "Инь и Ян"',
        "description": 'В китайской философии ян и инь символизировали взаимодействие крайних противоположностей: света и тьмы, дня и ночи, неба и земли, жары и холода. Вместе эти противоположности создавали баланс, гармонию во вселенной. А наши весы сбалансируют порцию вашего питомца.',
        "price": '43',
        "src": '../global-images/for-cards/smart-rodent-feeder-7.jpeg',
        "cardRating": '5',
        "category": ["maze"],
        "id": '42',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная тарелка-весы для грызунов "Ratiometric"',
        "description": '"Ratiometric" - умная тарелка-весы для ваших грызунов, которая световыми и звуковыми сигналами предупредит вас о слишком большой или слишком маленькой порции. Установите нужные параметры и больше не беспокойтесь о количестве съеденного вашим питомцем зерна.',
        "price": '37',
        "src": '../global-images/for-cards/smart-rodent-feeder-8.jpeg',
        "cardRating": '3.3',
        "category": ["maze"],
        "id": '43',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная кормушка-весы для грызунов "SmartGrub"',
        "description": '"SmartGrub" - универсальный помощник всем хозяйкам и хозяинам грызунов. которые склонны к перебарщиванию и преодолении отметки в норму. Звуковые и световые сигналы не позволят отдать своему питомцу слишком много, чтобы тот не страдал избыточным весом.',
        "price": '53',
        "src": '../global-images/for-cards/smart-rodent-feeder-9.jpeg',
        "cardRating": '3.0',
        "category": ["maze"],
        "id": '44',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная дверь для питомцев "Афина"',
        "description": 'Афина в древнегреческой мифологии — богиня справедливой войны и победы, а также мудрости, знаний, искусств и ремёсел. Её также просили о сохранении безопасности жилищу. Теперь она с помощью "всевидящего ока" запустит в дом только вашего любимца и никого другого.',
        "price": '160',
        "src": '../global-images/for-cards/smart-pet-door.jpeg',
        "cardRating": '5.0',
        "category": ["dog", "cat"],
        "id": '55',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная дверь для питомцев "Редюит"',
        "description": 'Под редюитом понимается всякий укрепленный пункт, расположенный позади главных укреплений и составляющий последний оплот обороны. Если от незнакомых животных вас не спасли забор, то точно поможет умная дверь "Редюит", которая не пустит в дом чужака.',
        "price": '170',
        "src": '../global-images/for-cards/smart-pet-door-2.jpeg',
        "cardRating": '4.3',
        "category": ["dog", "cat"],
        "id": '46',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Очиститель воздуха и уничтожитель запахов "Свежий Хвост"',
        "description": 'Если у вас превосходное обоняние и вы чувствуете даже самые слабые нотки любого аромата, то представляем вашему вниманию очиститель воздуха и уничтожитель запахов "Свежий Хвост". В вашем доме всегда будутмтолько запахи духов и цветов.',
        "price": '50',
        "src": '../global-images/for-cards/smart-odor-remover.jpeg',
        "cardRating": '5.0',
        "category": ["cat", "dog"],
        "id": '47',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Очиститель воздуха и уничтожитель запахов "АромаВЕТ"',
        "description": '"АромаВЕТ" - универсальный очиститель воздуха, который подойдёт для освежения дома как с котами, так и с собаками. Незаменимый помощник всех парфюмеров с нереально тонким нюхом и всех домохозяек с хорошим обонянием.',
        "price": '43',
        "src": '../global-images/for-cards/smart-odor-eliminator.jpeg',
        "cardRating": '3.1',
        "category": ["dog", "cat"],
        "id": '48',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная кормушка для богомола "МантисЛанч"',
        "description": '"МантисЛанч" - это умная кормушка с камерой и весами для вашего домашнего богомола. Главное ввести нужные параметры, а дальше - ежедневно добавлять еду, чтобы питомец был здоровым и счастливым. Наша кормушка сама придупредит вас голосовыми и звуковыми сигналами в экстренном случае.',
        "price": '29',
        "src": '../global-images/for-cards/smart-mantis-feeder-1.jpeg',
        "cardRating": '4.4',
        "category": ["unique"],
        "id": '49',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный дом для богомолов "Гестия"',
        "description": 'Гестия - в древнегреческой мифологии юная богиня семейного очага и жертвенного огня. Теперь она будет покровительствовать вашему питомцу: кормить, поить, регулировать свет, влажность и тепло, предупреждать о возможных болезнях и давать рекомендации по уходу.',
        "price": '72',
        "src": '../global-images/for-cards/smart-house-mantis-1.jpeg',
        "cardRating": '5.0',
        "category": ["unique"],
        "id": '50',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'У мный дом для богомола "Шинчу"',
        "description": 'Шинчу - это великие боги насекомых, которые напоминают мотыльков шелкопряда размером больше слона. Теперь "Шинчу" будет ухаживать за вашим питомцем: регулировать влажность, тепло и свет, кормить и поить ваших питомцев, чтобы они не болели.',
        "price": '75',
        "src": '../global-images/for-cards/smart-house-mantis-3.jpeg',
        "cardRating": '5.0',
        "category": ["unique"],
        "id": '51',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный дом для богомола "МантисРезиденция"',
        "description": '"МантисРезиденция" - умный дом для богомолов с искусственным регулированием подачи света, тепла и увлажнения воздуха, с умной поилкой и кормушкой для вашего питомца, с камерой-датчиком, анализирующим поведение животного.',
        "price": '79',
        "src": '../global-images/for-cards/smart-house-mantis-6.jpeg',
        "cardRating": '4.1',
        "category": ["unique"],
        "id": '52',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный поводок для собак "Дерг-Метр"',
        "description": '"Дерг-Метр" - умный собачий поводок, который сам потянет или даже аккуратно применит строгую силу, если ваш питомец резко чем-то заинтересуется. Удобную ручку можно повесить на запястье и, если питомец очень сильно занервничает, она завибрирует и подаст сигнал.',
        "price": '21',
        "src": '../global-images/for-cards/smart-dog-leash.png',
        "cardRating": '4.1',
        "category": ["dog"],
        "id": '53',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный поводок для собак "Поводок-Болтун"',
        "description": 'Если вы любите насладиться природой, поговорить с друзьями или позалипать в телефоне во время прогулки, то "Поводок-Болтун" - отличный вариант. Мягкая ручка не пережмёт, автомеханизм не даст собаке потянуть и повалить вас, сигналы предупредят, если питомец нервничает.',
        "price": '19',
        "src": '../global-images/for-cards/smart-dog-collar.png',
        "cardRating": '3.7',
        "category": ["dog"],
        "id": '54',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный собачий ошейник с GPS-навигатором "Аргус"',
        "description": 'Аргус -  персонаж древнегреческой мифологии. Многоглазый великан, в связи с чем получил эпитеты «Всевидящего» и «Многоглазого». Теперь "Аргус" будет всегда следить за вашим питомцем. Умный ошейник с навигатором пришлёт хозяину точное местоположение любимца.',
        "price": '17',
        "src": '../global-images/for-cards/smart-collar-with-gps.jpeg',
        "cardRating": '5.0',
        "category": ["dog"],
        "id": '55',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный собачий ошейник антилай "Звук выключен"',
        "description": '"Звук выключен" - умный собачий ошейник антилай, который аккуратной вибрацией учит вашего питомца хорошим манерам. Вместе с этим ошейником ваш любимец будет тише воды на улице и легко станет всеобщим мирным любимцем.',
        "price": '23',
        "src": '../global-images/for-cards/smart-collar-antibark.jpg',
        "cardRating": '4.8',
        "category": ["dog"],
        "id": '56',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная кормушка реагирующая на чип "Сытый носик"',
        "description": '"Сытый носик" - умная кормушка для владельцев большого количества котов и собак. Наша кормушка реагирует на чип и подаёт ровно столько корма, сколько нужно животному, а потом захлопнет дверцу, чтобы он не забрал лишнюю порцию.',
        "price": '131',
        "src": '../global-images/for-cards/smart-chip-feeder.png',
        "cardRating": '4.1',
        "category": ["dog", "cat"],
        "id": '57',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Домик с шумоподавлением для котов "Коттедж Безмолвия"',
        "description": 'Вы живёте в шумном районе? Возла вашего дома часто устраивают праздники и салюты? Ваши питомцы тяжело переживают громкие звуки? Тогда "Коттедж Безмолвия" с функцией шумоподавления - идеальный вариант для вашего котика.',
        "price": '97',
        "src": '../global-images/for-cards/smart-cat-antinoise-house.png',
        "cardRating": '4.8',
        "category": ["cat"],
        "id": '58',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная клетка для птиц "Чирик-контроль"',
        "description": '"Чирик-контроль" - умная клетка для домашних птичек с регулировкой тепла, света, влажности, подающая еду и корм, следящая за поведением вашего питомца. С ней и в зной не жарко, и в мороз не холодно, в сухую погоду не душно и в дождь не слишком влажно.',
        "price": '92',
        "src": '../global-images/for-cards/smart-cage-for-parrot.jpeg',
        "cardRating": '3.7',
        "category": ["bird"],
        "id": '59',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная клетка для птиц "Соловьиный уголок"',
        "description": '"Соловьиный уголок" - край, где вашей птичке захочется жить и радоваться жизни. Она проследит за светом, влажностью и теплом, не забудет покормить и попоить питомца, среагирует на любое изменение в его поведении и предупредит, если птичка будет плохо себя чувствовать.',
        "price": '97',
        "src": '../global-images/for-cards/smart-cage-for-parrot-5.jpeg',
        "cardRating": '4.2',
        "category": ["bird"],
        "id": '60',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Уличная кормушка с камерой "Зернышко-Онлайн"',
        "description": '"Зернышко-Онлайн" - незаменимый помощник орнитологам. Это кормушка, которая будет снимать птиц на камеру и самообучиться: сможет подрожать голосам птиц, создавать оптимальные условия для их жизни, соберёт полезные сведения об их взаимоотношениях.',
        "price": '60',
        "src": '../global-images/for-cards/smart-bird-feeder.jpg',
        "cardRating": '5.0',
        "category": ["bird"],
        "id": '61',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная уличная кормушка с камерой "Чирик-TV"',
        "description": 'Для любителей понаблюдать за птицами и юных орнитологов была создана кормушка "Чирик-TV". Многофункциональное устройство проследит за птицами, произведёт анализ их поведения и предоставит вам данные об их поведении, сотрудничестве, положении в птичьем обществе, характере.',
        "price": '52',
        "src": '../global-images/for-cards/smart-bird-feeder-with-camera.png',
        "cardRating": '5.0',
        "category": ["bird"],
        "id": '62',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный аквариум "Пузырьковый Рай"',
        "description": '"Пузырьковый Рай" -  умный аквариум, где рыбкам будет комфортно жить. Он сам будет регулировать чистоту воды, насыщенность кислородом, искусственную подачу света, поведение рыбок: никому не даст никого съесть, предупредит, если появяться паразиты.',
        "price": '81',
        "src": '../global-images/for-cards/smart-aquarium-1.jpeg',
        "cardRating": '3.6',
        "category": ["unique"],
        "id": '63',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный аквариум "Немо-Сити"',
        "description": 'С "Немо-Сити" вы можете не бояться, что с вашими рыбками что-то случиться. Он не даст им выпрыгнуть из воды, но насытит воду кислородом, он не даст размножаться вредным бактериям и паразитам, но не отравит питомцев, он не даст перекормить рыбок, но и голодными они не остануться.',
        "price": '89',
        "src": '../global-images/for-cards/smart-aquarium-2.jpeg',
        "cardRating": '4.5',
        "category": ["unique"],
        "id": '64',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный аквариум "Буль-Буль Уют"',
        "description": 'За рыбками сложно ухаживать, не правда ли? Они не смогут намекнуть вам, что они голодные, им не хватает кислорода, они заболели. С котами, собачками и птичками в этом смытле попроще: про их существование забыть сложнее. Это задача для нашего аквариума "Буль-Буль Уют".',
        "price": '86',
        "src": '../global-images/for-cards/smart-aquarium-3.jpeg',
        "cardRating": '4.2',
        "category": ["unique"],
        "id": '65',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный аквариум "Маленькая Атлантида"',
        "description": 'Атлантида - мифический остров. Атлантиду населяли потомки Посейдона, которые приступили к завоеванию Ойкумены. Нападение их было отражено древнейшими афинянами, после чего Зевс наслал на Атлантиду землетрясение и наводнение, от которых остров погрузился на морское дно...',
        "price": '89',
        "src": '../global-images/for-cards/smart-aquarium-4.jpeg',
        "cardRating": '5.0',
        "category": ["unique"],
        "id": '66',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный аквариум "Аква-Сказка"',
        "description": 'Если рыбы-бабушки и рассказывают рыбам-внукам какие-нибудь сказки, то какая-нибудь из них, как и у людей, должна быть про идеальный затерянный мир, в котором никогда не встретишь бе и горя. "Аква-Сказка" - ровно такое же место, куда с дества мечтает добраться каждая отважная рыбка. Там всегда есть свет, воздух и еда.',
        "price": '85',
        "src": '../global-images/for-cards/smart-aquarium-5.jpeg',
        "cardRating": '4.7',
        "category": ["unique"],
        "id": '67',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный аквариум «Параиба»',
        "description": '«Параиба» - это красивейшие подводные камни, называющиеся так по имени человека, который впервые их нашел. Они имеют насыщенный бирюзовый цвет — часто образно именуемый «цветом воды в бассейне», «электрическим», неоновым. Теперь - это ваш умный аквариум, где рыбкам всегда будет комфортно.',
        "price": '81',
        "src": '../global-images/for-cards/smart-aquarium-6.jpeg',
        "cardRating": '4.9',
        "category": ["unique"],
        "id": '68',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная игрушка для котика "Буль-буль карасики"',
        "description": 'Если вам кажется, что ваш питомец мало двигается и быстро набирает вес, то "Буль-буль карасики" сможет развеселить и заинтересовать его. Она станет незаменимым компаньоном на пути к весёлому и подвижному образу жизни вашего любимца.',
        "price": '11',
        "src": '../global-images/for-cards/robo-cat-fish.png',
        "cardRating": '4.1',
        "category": ["cat"],
        "id": '69',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная игрушка для котиков и маленьких собачек "Затаившийся дракон"',
        "description": 'Энимал флоу — это упражнения, похожие на движения животных. Они могут быть плавными, активными, мягкими или забавными. "Затаившийся дракон" - это поза в которой чаще всего будет пребывать ваше животное с нашей игрушкой.',
        "price": '15',
        "src": '../global-images/for-cards/robo-car-friend.png',
        "cardRating": '4.6',
        "category": ["dog", "cat"],
        "id": '70',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Трекер для рептилий и амфибий "Хамелеон-Шпион"',
        "description": '"Хамелеон-Шпион" - умный трекер, который будет следить за вашим питомцем и днём и ночью и предупреждать о любых изменениях в его настроении и поведении. Он скажет, если вашему любимцу чего-то не хватает, скажет, если есть подозрения о болезни.',
        "price": '31',
        "src": '../global-images/for-cards/reptile-tracker-2.jpeg',
        "cardRating": '5.0',
        "category": ["unique"],
        "id": '71',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Трекер для рептилий и амфибий "Змеюкин-Google Maps"',
        "description": 'Сколько раз ваш домашний питомец ел и пил? Куда он бегал, где бродил? На кого он охотился и нравятся ли ему условия, в которых он живёт? А если он сбежит из террариума и потеряется? С "Змеюкин-Google Maps" всё будет хорошо.',
        "price": '33',
        "src": '../global-images/for-cards/reptile-tracker-4.jpeg',
        "cardRating": '4.7',
        "category": ["unique"],
        "id": '72',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный трекер для рептилий и амфибий "Шапка-неведимка"',
        "description": 'Ваши рептилии и амфибии настолько хорошо приспосабливаются к окружающей местности, что способны спрятаться от вас даже в террариуме. Их поиск предоставьте "Шапке-неведимке". Наш умный трекер проследит за ним на протяжении дня и даст вам поддробный отчёт.',
        "price": '32',
        "src": '../global-images/for-cards/reptile-tracker-5.jpeg',
        "cardRating": '3.9',
        "category": ["unique"],
        "id": '73',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная камера для питомцев "Афса́ти"',
        "description": ' Афса́ти - — божество птиц и зверей в мифологии народов Кавказа. Теперь он будет всевидящим глазом следит за вашими питомцами и, если им станет скучно, то вы можете через динами успокоить своих любимцев. Он не даст питомцам соскучиться: может попеть, пошутить, поиграть.',
        "price": '19',
        "src": '../global-images/for-cards/remote-pet-camera.png',
        "cardRating": '5.0',
        "category": ["cat", "dog", "bird", "maze", "unique"],
        "id": '74',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный кроличий трекер "Кроль-Контроль"',
        "description": '"Кроль-Контроль" - умный трекер для кроликов и зайчиков. Если ваш питомец невероятно подвижен, то вы всегда можете повесить ему наш "Кроль-Контроль". Он посчитатет количество шагов-прыжков за день, пройденный путь, поможет найти питомца, если он потеряется.',
        "price": '14',
        "src": '../global-images/for-cards/raddit-trecker.jpeg',
        "cardRating": '3.2',
        "category": ["maze"],
        "id": '75',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный кроличий трекер "Зайкин Потеряшкин"',
        "description": 'Если у вас есть кролик, кторый любит побегать и пошалить, то "Зайкин Потеряшкин" был создан для вас. Наш трекер проследит за вашим питомцем, сообщит о проблемах, всегда подскажет, где зайку и кролика искать. Может дать рекомендации по уходу, если зверёк мало двигается.',
        "price": '17',
        "src": '../global-images/for-cards/rabbit-super-trecker.jpeg',
        "cardRating": '4.8',
        "category": ["maze"],
        "id": '76',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная лежанка с самоотоплением "Объятия Эри"',
        "description": 'Озеро Эри – четвертое по площади поверхности озеро из пяти Великих озер. Поскольку озеро – самое мелкое из Великих озер, оно также и самое теплое. Теперь "Объятия Эри" будет самонагреваться в холодную погоду и обогревать вашего любимца.',
        "price": '53',
        "src": '../global-images/for-cards/smart-bed.jpg',
        "cardRating": '4.9',
        "category": ["cat", "dog"],
        "id": '77',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Дом с шумоподавлением для котов "Мурлыкательный Дзен"',
        "description": 'Если ваш питомец нелюбит громкие звуки, а ваш район не славится своими тишиной и спокойствием, то умный домик "Мурлыкательный Дзен" - отличный подарок для вашего питомца. В нём питомец не будет слышать громкие звуки. Дом укроет его от салюта, рёвы машин, криков с улицы.',
        "price": '81',
        "src": '../global-images/for-cards/pre-noise-canceling-cat-3.jpeg',
        "cardRating": '4.6',
        "category": ["cat"],
        "id": '78',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Дом с шумоподавлением для котов "Ш-ш-ш Домик"',
        "description": 'Ваш питомец боиться громких звуков, но в доме совершенно нет звукоизолирующей комнаты? Ваш любимчик ужасно нервничает, что деться некуда? Представляем вашему вниманию "Ш-ш-ш Домик", который не даст проникнуть в его стены ни одному постороннему звуку.',
        "price": '87',
        "src": '../global-images/for-cards/pre-noise-canceling-cats-4.jpeg',
        "cardRating": '4.2',
        "category": ["cat"],
        "id": '79',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Дом с шумоподавлением для котов "SilentPurr"',
        "description": '"SilentPurr" - это невероятно тихий домик для котика. Подойдёт всем котикам в шумном районе и не только. Уникальные звукоизолирующие технологии сохранят тишину даже возле проспекта. Спешите подарить питомцу спокойный, тихий, умиротворяющий уголок с нашим домиком. ',
        "price": '83',
        "src": '../global-images/for-cards/pre-noise-canceling-cats_6.jpeg',
        "cardRating": '3.8',
        "category": ["cat"],
        "id": '80',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Автоматическая мойка для лап "Фланелевые обнимашки"',
        "description": 'Посчитайте питомцев, которые любят мыться. Пальцев на двух руках хватило, неправда ли? И большинство из них не коты... Представляем вам автоматическую мойку для лап "Фланелевые обнимашки". Питомцам всегда будет приятно помыть свои лапки после прогулки, а ваш пол останется чистым.',
        "price": '22',
        "src": '../global-images/for-cards/paw-washer.png',
        "cardRating": '5.0',
        "category": ["cat", "dog"],
        "id": '81',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Домик со звукоизоляцией для собак "Мягкий Лайфхак"',
        "description": 'Если вашей собачке некуда деться от посторонних громких и резких звуков, то мы откроем вам "Мягкий Лайфхак" (прямо как Колумб Америку). Теперь вы можесе не бояться за слух вашего питомцаЖ он не уловит ни единого шороха в своём новом жилище.',
        "price": '94',
        "src": '../global-images/for-cards/noise-canceling-dog-house-1.jpeg',
        "cardRating": '4.7',
        "category": ["dog"],
        "id": '82',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Домик со звукоизоляцией для собак "Тихий Гав`ань"',
        "description": 'А вы знали, что слух у собаки приоритетнее зрения, а слышат они в диапозоне частот до 45кГц? Представляете, как им приходиться тяжело, когда они слышат резкие, громкие, неприятные звуки? "Тихий Гав`ань" - отличное решение для сохранения слуха вашим любимцам.',
        "price": '91',
        "src": '../global-images/for-cards/noise-canceling-dog-house-2.jpeg',
        "cardRating": '3.4',
        "category": ["dog"],
        "id": '83',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Домик со звукоизоляцией для собак "Тихий Омут"',
        "description": 'Омут — водоворот с нисходящим движением воды, обычно на реке, образуемый встречным течением. Теперь ваш питомец попадёт в течение реки "Безмятежность". В этом логове ему будет всегда мирно и спокойно, что бы не происходило вокруг, какие бы звуки не раздавались.',
        "price": '106',
        "src": '../global-images/for-cards/noise-canceling-dog-house-3.jpeg',
        "cardRating": '3.0',
        "category": ["dog"],
        "id": '84',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Домик со звукоизоляцией для собак "Гав-фри Зона"',
        "description": '"Гав-фри Зона" -  домик с звукоизоляцией для ваших любимых питомцев, чтобы даже в самые шумные городские праздники, чтобы даже во время бурных шествий под вашими окнами, чтобы даже во время салюта ваш питомец нашёл тихий уютный уголок.',
        "price": '102',
        "src": '../global-images/for-cards/noise-canceling-dog-house-4.jpeg',
        "cardRating": '5.0',
        "category": ["dog"],
        "id": '85',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Домик со звукоизоляцией для собак "Департамент Гесихии"',
        "description": 'В древнегреческой мифологии Гесихия - богиня тишины. Теперь она будет править в уютном домике вашего юбимчика. Ни один звук, ни один малейший шорох не сможет пробраться в её владения. В царстве этой богини всегда будут тишина и спокойствие.',
        "price": '111',
        "src": '../global-images/for-cards/noise-canceling-dog-house-5.jpeg',
        "cardRating": '5.0',
        "category": ["dog"],
        "id": '86',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Массажный комплекс для животных "Оазис Релакса"',
        "description": '"Оазис Релакса" - уникальный массажный комплекс. Он был создан не для людей, а для наших маленьких верных друзей - собачек и котиков. Здесь они смогут почувствовать комфорт и расслабление. Если вы хотите сделать вашим питомцам сказочный подарок, то "Оазис Релакса" уже ждёт.',
        "price": '100',
        "src": '../global-images/for-cards/massage-complex.jpg',
        "cardRating": '5.0',
        "category": ["cat", "dog"],
        "id": '87',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Трекер для рептилий и амфибий "ReptoAmfiTrack"',
        "description": '"ReptoAmfiTrack" - это серёзный трекер для ваших животных. Для него нет слова невозможно. Он способен рассчитать пройденный путь вашего животного, рассказать сколько он съел корма за день, сколько воды пил, где был, что делал и многое другое. Незаменимый помощник герптелогов.',
        "price": '99',
        "src": '../global-images/for-cards/lizard-tracker-4.jpeg',
        "cardRating": '5.0',
        "category": ["unique"],
        "id": '88',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Ошейник с Led-подсветкой для собак "Аммолитовое ожерелье"',
        "description": 'Аммолит похож на чешую красочного дракона и является одним из самых редких и ярких драгоценных камней. Теперь ожерелье из этих радужных чешуек будет всегда указывать на точное местоположение вашего питомца в темноте.',
        "price": '26',
        "src": '../global-images/for-cards/led-dog-collar.png',
        "cardRating": '4.5',
        "category": ["dog"],
        "id": '89',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Автоматическая мойка лап для питомца "Авто-Пух"',
        "description": '"Авто-Пух" - это автомотическая мойка лап вашего питомца с ш=пушистыми щёточками, которая не оставит равнодушными ни вас, ни вашего питомца, ни ваш пол. Ваши питомцы полюбят мыть лапки после прогулки, а пол не придётся ежедневно перемывать от следов.',
        "price": '24',
        "src": '../global-images/for-cards/animal-paw-washer.jpeg',
        "cardRating": '5.0',
        "category": ["dog", "cat"],
        "id": '90',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Домик со звукоизоляцией для питомцев "Замок ЗвукOFF"',
        "description": 'В домике "Замок ЗвукOFF" ваши питомцы всегда смогут услышать тишину. Когда мы, люди, сможем одеть наушники или воткнуть бируши, наши питомцы будут уходить в свою крепость, где их будет ожидать безмолвие.',
        "price": '103',
        "src": '../global-images/for-cards/anti-noise-animal-house.jpg',
        "cardRating": '4.6',
        "category": ["dog", "cat"],
        "id": '91',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Птичий трекер "Пернатый дозор"',
        "description": 'Вы часто оставляете вашу птичку за хозяина дома? Знаете, что она делает в ваше отсутствие? "Пернатый дозор" - это трекер, который даст ответ на все ваши вопросы и даж больше, например, развеселит питомца в ваше отсутствие или научит говорить.',
        "price": '37',
        "src": '../global-images/for-cards/bird-tracker-2.jpeg',
        "cardRating": '4.5',
        "category": ["bird"],
        "id": '92',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Птичий трекер "Чик-чирик Друг"',
        "description": '"Чик-чирик Друг" - это классный компаньон для любой птички. Он быстро наладит отношения с вашим питомцем и станет ему приятелем. Он будет следить за его здоровьем и сообщать вам о всех изменениях, а ещё веселить, когда вас нет рядом.',
        "price": '34',
        "src": '../global-images/for-cards/bird-trecker-1.jpeg',
        "cardRating": '3.1',
        "category": ["bird"],
        "id": '93',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Птичий трекер "Крылатый Защитник"',
        "description": 'Прогрессивный "Крылатый Защитник" способен на многое: дать рекомендации по уходу за питомцем, сообщить о том, что вашему любимцу холодно, голодно, жарко или душно, поразвлекать его в ваше отсутствие и предупредить, если есть признаки болезни или клетка очень грязная.',
        "price": '32',
        "src": '../global-images/for-cards/bird-trecker-4.jpeg',
        "cardRating": '3.0',
        "category": ["bird"],
        "id": '94',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Птичий трекер "Заботливый сосед"',
        "description": 'Как хорошо, когда у вас есть тот, на кого можно положиться в деле ухода за животными. Если ваши дети упросили птичку, но не заботятся о ней, то о ней позаботиться "Заботливый сосед". Новые технологии сами проследят за здоровьем, предупредят и напомнят о дискомфорте в клетке.',
        "price": '33',
        "src": '../global-images/for-cards/bird-trecker-6.jpeg',
        "cardRating": '4.4',
        "category": ["bird"],
        "id": '95',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная миска для питомцев "Куст роз"',
        "description": 'Представляем вам новую технологию от переедания - миску "Куст роз". Чем дольше ест питомец, тем больше остреет миска. Через четверь часа она вся превратиться в шипы и вашему любимцу будет тяжело доставать корм. Она, таким образом, поможет ему не переедать и оставаться стройным.',
        "price": '35',
        "src": '../global-images/for-cards/bowl-for-overeating.jpeg',
        "cardRating": '4.3',
        "category": ["dog", "cat"],
        "id": '96',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Электронная кнопка общения "Секрет общения"',
        "description": 'Наша болтливая технология "Секрет общения" поможет вашему питомцу научиться общаться с вами почти на равных. Кнопка может издавать различные звуки. Немного тренировок научат питомца нажимать на кнопку с определённой просьбой. Теперь вам будет проще понть его.',
        "price": '8',
        "src": '../global-images/for-cards/button-for-communication.png',
        "cardRating": '4.6',
        "category": ["dog", "cat"],
        "id": '97',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Круговой душ для собак "Водяное торнадо"',
        "description": 'Не все собаки любят мыться, зато все любят проводить время на свежем воздухе. Любая собака легко пачкается, но не всегда легко отмывается. С круговым душем "Водяное торнадо" процесс принятия душа станет эффективнее, интереснее и менее затратным в плане нервов и времени.',
        "price": '27',
        "src": '../global-images/for-cards/circle-shower-for-dogs.jpeg',
        "cardRating": '5.0',
        "category": ["dog"],
        "id": '98',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Ошейник против насекомых "Крепость Анти-паразит"',
        "description": '"Крепость Анти-паразит" - это надёжный друг для вашего питомца дома и на природе. Теперь ему не страшны ни клещи, ни комары, ни блохи. Безопасный ошейник защити его от нападок насекомых везде и всюду, мягкий, он не передавит и не натрёт собачке шею, но, при этом, будет крепко держаться.',
        "price": '22',
        "src": '../global-images/for-cards/collar-against-insects.jpg',
        "cardRating": '5.0',
        "category": ["dog"],
        "id": '99',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Ошейник анти-лай "Воспитатель ГавOFF"',
        "description": '"Воспитатель ГавOFF" сделает вашего питомца любителем всей округи. Лёгкой и нежной вибрацией он отучит вашу собаку лаять без причины. После уроков хорошим манерам ваш друг станет одним из самых воспитанных представителей своего рода, аристократом, интеллигентом.',
        "price": '26',
        "src": '../global-images/for-cards/collar-anti-bark.png',
        "cardRating": '4.0',
        "category": ["dog"],
        "id": '100',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Поводок-автополив для собак "Дождик в четверг"',
        "description": 'Всегда хорошо в жаркую погоду освежиться. Люди могут купить себе мороженое, лимонад. К сожалению, если мы не идём на речку, а, к примеру, гуляем по душному пыльному городу, то нашим четверолапым друзьям бывает тяжело. Здесь на помощь приходит "Дождик в четверг".',
        "price": '30',
        "src": '../global-images/for-cards/collar-auto-shower.jpg',
        "cardRating": '5.0',
        "category": ["dog"],
        "id": '101',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный собачий трекер "Хвостатый компас"',
        "description": '"Хвостатый компас" - это умный трекер для вашего питомца. С таким спутником ваш пёсик не потеряется. Трекер посчитает, сколько километров прошёл ваш питомец, где останавливался, расскажет, какие места ему нравятся больше всего.',
        "price": '32',
        "src": '../global-images/for-cards/collar-dog-trecker.png',
        "cardRating": '4.3',
        "category": ["dog"],
        "id": '102',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный собачий трекер с камерой "Я иду тебя искать"',
        "description": 'Никогда не хотели увидеть мир глазами своего питомца? Теперь вы сможете это сделать с помощью ошейника-трекера с камерой "Я иду тебя искать". Благодаря нему вы увидите весь путь, пройденный питомцем, узнаете, с кем он встречался, чем занимался во время своей прогулки.',
        "price": '36',
        "src": '../global-images/for-cards/collar-trecker-with-camera.png',
        "cardRating": '4.0',
        "category": ["dog"],
        "id": '103',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Чашка-душ для лап "Душ для лапки"',
        "description": 'Вашим питомцам когда-нибудь было интересно, что находится у вас на полках, в шуфлядках, в посуде? Теперь ваши любимцы с чистой совестью смогут пополоскать свои лапы в вашей кружке. Только, к сожалению, вы в ней никогда не сможете заварить чай или кофе.',
        "price": '25',
        "src": '../global-images/for-cards/cup-paw-shower.jpg',
        "cardRating": '4.2',
        "category": ["dog", "cat"],
        "id": '104',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Машинка для бросания шариков собакам "Летай, Шарик!"',
        "description": 'Гаджет "Летай, Шарик!" с камерой - это отличный повод позабавиться для вашего питомца. Машина будет метать шарики, пока пёсик не устанет. А до этого момента ваc ждут горе шариков и море веселья.',
        "price": '70',
        "src": '../global-images/for-cards/dog-ball-thrower-with-camera.png',
        "cardRating": '3.8',
        "category": ["dog"],
        "id": '105',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Машинка для бросания шариков собакам "Fetch-o-Matic"',
        "description": 'Ваш питомец хочет поиграть, а вы заняты? Он требует внимания, а у вас нет времени? Пёсик вертиться под ногами, а у вас куча дел? "Fetch-o-Matic" - это универсальная игрушка для ваших любимцев, которая займёт их надолго.',
        "price": '58',
        "src": '../global-images/for-cards/dog-ball-thrower.png',
        "cardRating": '3.9',
        "category": ["dog"],
        "id": '106',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Ошейник против насекомых "BugBlocker"',
        "description": '"BugBlocker" - это верный защитник от любых насекомых для вашего питомца. Поводок удобно крепиться к руке и защищает владельца от падения при резких движениях собаки. Ошейник мягко прилегает к шее собаки, не трёт и не жмёт.',
        "price": '20',
        "src": '../global-images/for-cards/dog-flea-protection.jpg',
        "cardRating": '5.0',
        "category": ["dog"],
        "id": '107',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Звонок для двери для питомцев "Динь-Динь-Гав-Мяу"',
        "description": 'У вас нет дверцы для животных в двери, но, вы не хотите, чтобы питомец царапался, так как испортит дорогую вешь? "Динь-Динь-Гав-Мяу" - это умный звнок от двери. Несколько систематических тренировок и ваш питомец будет звонить перед тем, как войти.',
        "price": '41',
        "src": '../global-images/for-cards/door-bell-for-animals.jpeg',
        "cardRating": '4.9',
        "category": ["dog", "cat"],
        "id": '108',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Автоматическая сушилка для питомцев "Ураган Катрина"',
        "description": '"Ураган Катрина" -  самый разрушительный тропический циклон в истории США. Теперь эта сверхмощная воздушная масса за считанные секунды высушит вашего питомца. Ему и вам не придётся проходить долгие и нудные процессы сушки: раз, два - и готово.',
        "price": '75',
        "src": '../global-images/for-cards/dry-house.jpg',
        "cardRating": '4.1',
        "category": ["cat", "dog"],
        "id": '109',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Тёплая кормушка для птиц "Lunch Зона"',
        "description": 'Если вы любите ухаживать за птицами и наблюдать за их поведением, то, преобретая кормушку "Lunch Зона", вы одним кликом ловите двух зайцев. Отопление в кормушке не даст птичкам замёрзнуть зимой, а камера даст вам видео их поведения.',
        "price": '102',
        "src": '../global-images/for-cards/eco-feeder-for-birds.png',
        "cardRating": '5.0',
        "category": ["bird"],
        "id": '110',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Чашка-душ для лап "Foot Spa"',
        "description": '"Foot Spa" - это оригинальный способ легко и быстро помыть лапки после прогулки вашему питомцу. Это не займёт много времени, зато принесёт удовольствие и вам, и вашему питомцу, и вымытому полу. Мягкие щёточки аккуратно и безопасно протрут лапки вашему любимцу, а вода всегда останется тёплой и приятной.',
        "price": '30',
        "src": '../global-images/for-cards/electro-paw-cleaner-2.jpeg',
        "cardRating": '4.7',
        "category": ["cat", "dog"],
        "id": '111',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная электронная дверь для питомцев "Тук-тук. Кто там?"',
        "description": 'Электронная дверь "Тук-тук. Кто там?" откроет только в том случае, если узнает вашего питомца или среагирует на его ошейник. В противном случае она останется закрытой и не впустит в дом чужака. Пригодиться всем тем, к кому постоянно на дом наведываются гости.',
        "price": '65',
        "src": '../global-images/for-cards/electronic-door-pet.png',
        "cardRating": '5.0',
        "category": ["dog", "cat"],
        "id": '112',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный ошейник от насекомых для котов "CatProtect"',
        "description": 'Умный ошейник от насекомых "CatProtect" защитит вашего питомца от любого насекомого. Для достижения своей цели он будет использовать все подручные средства, безопасные для вашего любимца: свет, звук, запах.',
        "price": '34',
        "src": '../global-images/for-cards/flea-cat-protection.png',
        "cardRating": '5.0',
        "category": ["cat"],
        "id": '113',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный ошейник от насекомых для котов "ИнсектоСтоп"',
        "description": '"ИнсектоСтоп" не пощадит насекомых, жаждущих пробраться к вашему питомцу. Им придётся столкнуться с тремя ступенями защиты: светом, запахом и звуком. И ошейник не остановится ни перед чем, только бы выполнить свою первоочередную задачу.',
        "price": '33',
        "src": '../global-images/for-cards/flea-collar-for-cats.jpg',
        "cardRating": '4.5',
        "category": ["cat"],
        "id": '114',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Ошейник против насекомых "Операция Анти-Flea"',
        "description": 'Вашей собаке очень повезёт, если вы приобретёте для неё ошейник "Операция Анти-Flea". И у неё есть три причины быть счастливой. Первое, ошеник очень мягок, лёгок, не жмёт и не тянет. Второе, он защитит её от любого насекомого. Третье, он не растегнётся, когда она будет играть.',
        "price": '35',
        "src": '../global-images/for-cards/flea-dog-protection.png',
        "cardRating": '4.8',
        "category": ["dog"],
        "id": '115',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Ошейник против насекомых для питомцев "Замок Крак де Шевалье"',
        "description": 'Замок Крак де Шевалье - крепость госпитальеров. Считается одной из самых неприступных крепостей средневековья. Теперь, если насекомые захотят добраться до вашего питомца, им придётся держать осаду ошейника, и удача будет не на их стороне.',
        "price": '31',
        "src": '../global-images/for-cards/insects-cat-and-dog-protection.png',
        "cardRating": '4.0',
        "category": ["cat", "dog"],
        "id": '116',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный ошейник от насекомых для котов "SmartGuard"',
        "description": '"SmartGuard" - это целая оборонительная крепость, которой не страшны ни жара, ни холод, ни метель, ни град. Он не упадёт при самом быстром беге, не расстегнётся, как бы на него не давили и, что самое главное, не подпустит насекомых близко к вашему любимцу.',
        "price": '28',
        "src": '../global-images/for-cards/leaf-cat-protection-from-insects.jpeg',
        "cardRating": '3.3',
        "category": ["cat"],
        "id": '117',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный домик для грызунов "Хомяктика" ',
        "description": 'Если у грызунов есть своя культура, то у них ести легенды и мифы, и  из них обязательно будет про "Хомяктику". В разных народах она называлась бы по-разному: "Хоммастер", "Грызлик-Хоум", "Хомячий Олимп", "Грызлик-Сити", но везде это было бы самым лучшим местом на земле.',
        "price": '111',
        "src": '../global-images/for-cards/smart-maze-house-1.jpeg',
        "cardRating": '4.1',
        "category": ["maze"],
        "id": '118',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный домик для грызунов "Хомячий Бульвар"',
        "description": '"Хомячий Бульвар" - это многофункциональный домик для разведения грызунов и любых других маленьких грызунов. Он невероятно вместителен: в два этажа, со всеми лестницами и туннелями. Он предусматривает регулировку света, тепла, влажности, подачу еды и воды.',
        "price": '121',
        "src": '../global-images/for-cards/smart-cage-for-maze-1.jpg',
        "cardRating": '4.4',
        "category": ["maze"],
        "id": '119',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный домик для грызунов "Маленький Город"',
        "description": 'Вы разводите грызунов, но вам сложно за ними ухаживать?.. Представляем вашему вниманию наше новое изобретение: "Маленький Город" - это искусственное освещение, отопление, освежение и подкормка. Ваши питомцы больше не будут тревожить вас по-поводу и без. ',
        "price": '113',
        "src": '../global-images/for-cards/smart-cage-for-maze-2.jpg',
        "cardRating": '4.6',
        "category": ["maze"],
        "id": '120',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный домик для грызунов "Пушистик Ленд"',
        "description": 'Ваши дети попросили подарить им питомца и вы купили хомячка, шиншиллу, мышку... Они не ухаживают за ним - и всю работу приходиться делать вам? Умный дом "Пушистик Ленд" освобдит вас от лишних забот. Теперь ваши любимцы всегда будут накормлены и здоровы.',
        "price": '89',
        "src": '../global-images/for-cards/smart-cage-for-maze-3.png',
        "cardRating": '3.5',
        "category": ["maze"],
        "id": '121',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный домик для грызунов "Хомякус-Вилл"',
        "description": 'Вы никогда не мечтали о своей собственной вилле или о коттедже на берегу моря? Наверное, этого хотели бы все. Если люди не могут себе позволить виллу, то давайте подарим это нашим питомцам с "Хомякус-Вилл".',
        "price": '79',
        "src": '../global-images/for-cards/smart-cage-for-maze-4.png',
        "cardRating": '4.2',
        "category": ["maze"],
        "id": '122',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный домик для грызунов "Грызлик-Город"',
        "description": 'Если вы куда-то постоянно уезжаете и вам не с кем оставить своего питомца. то вы всегда можете преобрести "Грызлик-Город". Вам больше не придётся волноваться о том, где был ваш питомец, что он делал, здоров и накормлен ли он ни во время поездки, ни дома.',
        "price": '85',
        "src": '../global-images/for-cards/smart-cage-for-maze-5.png',
        "cardRating": '3.1',
        "category": ["maze"],
        "id": '123',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный домик для грызунов  "Хомячий Дрим"',
        "description": ' "Хомячий Дрим" - это универсальный помощник. Он никогда не оставит вашего питомца одного, всегда напомнит хозяевам о его существовании, проследит за ним во время отъеза, поменяет воду, корм, увлажнит воздух, охладит или утеплит, сделает ярче или тише свет.',
        "price": '87',
        "src": '../global-images/for-cards/smart-cage-for-maze-6.png',
        "cardRating": '4.5',
        "category": ["maze"],
        "id": '124',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный аквариум для черепашек "Черепаший дворец"',
        "description": 'Любителям всего тихого и спокойного представляем "Черепаший дворец". Если ваш питомец настолько тих и медлителен, что вы можете забыть о его существовании, та наш умный аквариум обязательно позаботиться о ней, а когда в нём закончится вода или еда - позовёт.',
        "price": '93',
        "src": '../global-images/for-cards/turtle-smart-house-1.jpeg',
        "cardRating": '4.6',
        "category": ["unique"],
        "id": '125',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умнй аквариум для черепашек "Аква-Уют"',
        "description": 'Бывало ли у вас такое, что вы страшно устали, но идёте ухажиать за своим молчаливым неторопливым любимцем? Мы знаем решение. Теперь, когда вы устаёте, можете не беспокоиться о его самочувствии: всю работу, которую не сделаете вы сделает за вас "Аква-Уют".',
        "price": '78',
        "src": '../global-images/for-cards/turtle-smart-house-2.jpeg',
        "cardRating": '3.5',
        "category": ["unique"],
        "id": '126',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный аквариум для черепашек "Морской дворик"',
        "description": 'Готовы поспорить, что в таких условиях, в каких будет жить ваша черепашка, захочется жить и вам самим. В аквариуме "Морской дворик" есть всё: свет, тепло, вода, насыщенная кислородом и еда. Черепашкам будет очень комфортно в вечно чистом домике. ',
        "price": '90',
        "src": '../global-images/for-cards/turtle-smart-house-3.jpeg',
        "cardRating": '4.7',
        "category": ["unique"],
        "id": '127',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная мойка для черепашек "Брюльчик-Шайн"',
        "description": 'Когда чистишь черепаший аквариум, не стоит забывать о чистоте самой черепашки. С "Брюльчик-Шайн" процесс купания для вашей черепашки превратиться в классное захватывающее приключение. Мягкие щёточки не поцарапают панцирь, а вода всегда булет тёплой и приятной.',
        "price": '69',
        "src": '../global-images/for-cards/tirtle-wash-1.jpg',
        "cardRating": '3.6',
        "category": ["unique"],
        "id": '128',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная мойка для черепашек "Тропический бриз"',
        "description": 'Как быстро, а главное аккуратно помыть свою черепашку? Представляем вам умную мойку для черепашек "Тропический бриз". Она мягко и аккуратно вычистить каждый, даже самый маленький изгиб на её панцире. Он будет блестеть и сверкать после такого душа.',
        "price": '54',
        "src": '../global-images/for-cards/turtle-wash-2.jpg',
        "cardRating": '4.9',
        "category": ["unique"],
        "id": '129',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная мойка для черепашек "Кокосовая лагуна"',
        "description": 'Умная мойка для черепашек "Кокосовая лагуна" - это простой способ вымыть вашу черепашку. Наша мойка не наврелит: не поцарапает, не порежет, не обольёт слишком горячей или слишком холодной водой. Она сделает всё быстро, красиво и безболезненно. Ваша черепашка и глазом не успеет моргнуть.',
        "price": '47',
        "src": '../global-images/for-cards/turtle-wash-3.jpg',
        "cardRating": '3.2',
        "category": ["unique"],
        "id": '130',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная мойка для черепашек "Морская пена"',
        "description": 'Вашеё черепашке явно не хватает разнообразия, но мы точно знаем, как ей раскрасить жизнь. "Морская пена" - это невероятно быстрый и лёгкий способ порадовать не только себя тем, что вам не придёться долго возиться, но и доставить удовольствие вашему питомцу.',
        "price": '51',
        "src": '../global-images/for-cards/turtle-wash-4.jpg',
        "cardRating": '4.3',
        "category": ["unique"],
        "id": '131',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная тёплая лежанка для мини-козы "Тёплые копытца"',
        "description": 'Мини-коза является одним из самых редких домашних питомцев. Не все рискнут завести такого рогатого пони. Однако тем, кто отважился это сделать, и тем, кто любит своего питомца, предлагаем испытать козью лежану "Тёплые копытца" с функцией самоотопления.',
        "price": '160',
        "src": '../global-images/for-cards/bed-for-pygmy-goat-1.jpeg',
        "cardRating": '4.0',
        "category": ["unique"],
        "id": '132',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная тёплая лежанка для мини-козы "Козья печка"',
        "description": 'Поздравляем всех любителей экзотических крупных питомцев! Только для обладателей милых мини-коз: настоящая лежанка-печка с самоотоплением. Она в любую погоду не даст ему замёрзнуть, потому что нагреется самостоятельно заранее.',
        "price": '164',
        "src": '../global-images/for-cards/bed-for-pygmy-goat-2.jpeg',
        "cardRating": '3.0',
        "category": ["unique"],
        "id": '133',
        "numm": '0',
    }, {
        "image": './images/black-heart.png',
        "titel": 'Умная тёплая лежанка для мини-козы "SmartCozy"',
        "description": '"SmartCozy" - это универсальная находка. Мало кто имеет в своём доме питомцем-другом мини-козу. Но для тех, кто сделал это, представляем умную лежанку с подогревом, на которой с лёгкостью поместиться даже взрослая козочка.',
        "price": '167',
        "src": '../global-images/for-cards/bed-for-pygmy-goat-3.jpeg',
        "cardRating": '4.7',
        "category": ["unique"],
        "id": '134',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный домик для шиншилл "Шиншилляндия"',
        "description": 'Всем любителям шиншилл просьба принести объявление: обладателям шиншилл предлагаем обрести новейший, технологичный, прогрессивный домик для своих любимцев "Шиншилляндия". Ваши питомцы всегда будут в тепле и уюте, накормленные и счастливые.',
        "price": '74',
        "src": '../global-images/for-cards/smart-house-for-chinchilla.jpeg',
        "cardRating": '3.2',
        "category": ["maze"],
        "id": '135',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный домик для шиншилл "Шуши-дом"',
        "description": 'Отгадайте с трёх раз: какой домик преобрести для своего питомца? Правильный ответ: "Шуши-дом". Умный домик для шиншилл будет круглосуточно следить за светом, теплом, воздухом, кормом и развлечением для любимца.',
        "price": '69',
        "src": '../global-images/for-cards/smart-house-for-chinchilla-1.jpeg',
        "cardRating": '4.8',
        "category": ["maze"],
        "id": '136',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный домик для шиншилл "Пушистик-хаус"',
        "description": '"Пушистик-хаус" - это домик для ваших четверолапых друзей, который может похвастаться климат- и корм-контролем. Он не подведёт вас. С ним вы можете оставить вашего любимца и на короткий, и на длинный срок.',
        "price": '81',
        "src": '../global-images/for-cards/smart-house-for-chinchilla-2.jpeg',
        "cardRating": '4.5',
        "category": ["maze"],
        "id": '137',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный домик для шиншилл "Песчаный дворец"',
        "description": 'Вы знаете, что Шиншиллы – это Шерлок Холмс в мире животных! Эти любопытные маленькие пушистики любят исследовать свое окружение. Им нужны: Пространство для прыжков и бега, безопасные места для укрытия и отдыха, пылевая ванна, вода и еда.',
        "price": '75',
        "src": '../global-images/for-cards/smart-house-for-chinchilla-3.jpeg',
        "cardRating": '3.5',
        "category": ["maze"],
        "id": '138',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный домик для шиншилл "Вилла "Шиши"',
        "description": 'Всё, что нужно шиншиллам вы най дёте в нашей вилле "Шиши". Тут есть пространство для исследований, место для физических упражнений, искусственные освещение и обогрев, а также пылевые ванны и безопасные места для отдыха.',
        "price": '84',
        "src": '../global-images/for-cards/smart-house-for-chinchilla-4.jpeg',
        "cardRating": '3.8',
        "category": ["maze"],
        "id": '139',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный домик для белок "Дупло+"',
        "description": 'Белки - очень интересные зверьки: , несмотря на милый внешний вид, в меру агрессивные и подозрительные зверьки. Вместе с тем они довольно умны и хитры. В их новом домике будет место для занятий спортом, отдыха и склад с орехами на зиму.',
        "price": '90',
        "src": '../global-images/for-cards/smart-house-for-squirrel.jpeg',
        "cardRating": '5.0',
        "category": ["maze"],
        "id": '140',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный домик для морских свинок "Травяной дворец"',
        "description": 'Морские свинки любят шарики для тенниса, пинг-понга, детские деревянные кубики, маленькие мягкие игрушки. Всё это они найдут в домике "Травяной дворец". Он сохранит здоровье вашему питомцу с помощью климат-контроля и подарит веселье.',
        "price": '87',
        "src": '../global-images/for-cards/smart-house-for-a-guinea-pig.jpeg',
        "cardRating": '4.5',
        "category": ["maze"],
        "id": '141',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный домик для морских свинок "Хрю-хрю резиденция"',
        "description": 'В "Хрю-хрю резиденция" есть не только игрушки для ваших любимцев и место, где можно с ними поиграть. Здесь зверьки будут под охраной искусственной подачи света, регулирови температуры и влажности, подачи их любимого корма и чистой воды.',
        "price": '72',
        "src": '../global-images/for-cards/smart-house-for-a-guinea-pig-1.jpeg',
        "cardRating": '4.0',
        "category": ["maze"],
        "id": '142',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный робо-компаньон "Infinity"',
        "description": 'Символ бесконечности — популярный символ дружбы, представляющий вечную природу связи между двумя друзьями. Если вы хотите, чтобы ваш питомец обрёл себе настоящего друга на столетия, то робо-компаньон "Infinity" готов им стать.',
        "price": '36',
        "src": '../global-images/for-cards/companion-robot.jpg',
        "cardRating": '5.0',
        "category": ["cat", "dog"],
        "id": '143',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Мышь на пульте дистанционного управления "Зумер"',
        "description": '"Зумер" - это радиоуправляемая мышка, с помощью которойвы сможете поиграть со своим питомцем веселее, чем обычно. Вам больше не придётся бегать с игрушками для котиков: садитесь на диван или в кресло и наслаждайтесь игрой с любимцем.',
        "price": '11',
        "src": '../global-images/for-cards/remote-control-mouse.jpg',
        "cardRating": '5.0',
        "category": ["cat"],
        "id": '144',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Игрушка бегающий мячик "Фантом"',
        "description": 'Футбол, футзал, хоккей с мячом, хоккей на траве, водное поло, поло, баскетбол, гандбол и пушбол, волейбол, теннис, настольный теннис, спайкбол - все эти игры происходят при учстии мяча. Вот, какое полезное изобретение - мяч. А наш шустрик с радостью поиграет с вашим питомцем.',
        "price": '8',
        "src": '../global-images/for-cards/interactive-ball-for-dogs.jpg',
        "cardRating": '4.2',
        "category": ["dog"],
        "id": '145',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Игрушка бегающий мячик "Энерджайзер"',
        "description": 'Уровень активности собаки: от одного часа в день и более. Кошки прекрасно себя чувствуют, получая физическую нагрузку время от времени в течение дня. Они активные животные, им нравится попрыгать, залезть куда-нибудь и поиграть. Наш робот поможет организовать им эту нагрузку.',
        "price": '7',
        "src": '../global-images/for-cards/interactive-car-with-manual-and-automatic-control.jpg',
        "cardRating": '3.9',
        "category": ["cat", "dog"],
        "id": '146',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Игрушка бегающий мячик "Колобок"',
        "description": 'Колобо́к — персонаж восточнославянских народных сказок, изображаемый в виде пшеничного хлеба шарообразной формы и одновременно — головы, который сбежал от испёкших его бабушки и дедушки, от разных зверей, но был съеден лисой. Наш Колобок будет долго бегать от вашего питомца.',
        "price": '9',
        "src": '../global-images/for-cards/interactive-rotating-ball.jpg',
        "cardRating": '4.7',
        "category": ["cat", "dog"],
        "id": '147',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная лежанка для вомбата "Логово страны грез"',
        "description": ' вомбата — роющие норы травоядные животные, напоминающие маленьких медведей или гигантского хомяка. вомбата довольно дружелюбны, любят ласку и легко приручаются. Могут жить в доме. Для них есть и лежанка, которая всегда согреет.',
        "price": '187',
        "src": '../global-images/for-cards/wombat-bed.jpeg',
        "cardRating": '4.5',
        "category": ["unique"],
        "id": '148',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная лежанка для вомбата "Среда обитания "Тепловая волна"',
        "description": 'В основном в качестве домашних любимцев они живут в домах Австралии. вомбата спят в среднем около 16 часов в день. Чтобы домашним вомбатам было тепло спать была изобретена умная лежанка с самонагревом.',
        "price": '185',
        "src": '../global-images/for-cards/wombat-bed-1.jpeg',
        "cardRating": '3.6',
        "category": ["unique"],
        "id": '149',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная лежанка для вомбата "Нора для объятий"',
        "description": 'Для всех, кто держит дома вомбата, у нас хорошая новость: мы изобрели лежанку для вомбата "Нора для объятий". Здесь вомбата всегда могут отдохнуть и поспать в теплоте и уюте. Это будет отличным подарком как для взрослой особи, так и для маленького животного.',
        "price": '182',
        "src": '../global-images/for-cards/wombat-bed-2.jpeg',
        "cardRating": '4.0',
        "category": ["unique"],
        "id": '150',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный домик для фенека "Уютная дюна"',
        "description": 'Фе́нек — миниатюрная лисица с крупными относительно тела ушами. Это один из редчайших домашних питомцев. Как же за ним ухаживать? Наш умный домик с климат-контролем "Уютная дюна" уже получил инструкции и готов работать. ',
        "price": '91',
        "src": '../global-images/for-cards/smart-house-for-fennec.jpeg',
        "cardRating": '4.6',
        "category": ["unique"],
        "id": '151',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный домик для фенека "Секрет песков"',
        "description": '"Секрет песков" - это тот, кто знает, как ухаживать за пустынными лисами и готов вам помочь в нелёгком деле заботы о таком редком животном. Он проследит за питомцем и даст рекомендации по уходу. Всем новичкам в этом благородном деле в увеличении популяции фенеков в помощь.',
        "price": '98',
        "src": '../global-images/for-cards/smart-house-for-fennec-1.jpeg',
        "cardRating": '3.2',
        "category": ["unique"],
        "id": '152',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный домик для фенека "Песчаный замок"',
        "description": 'Нелегко ухаживать за миниатюрной пустынной лисичкой. Какая температура оптимальна? Надо ли увлажнять воздух? Какое освещение она предпочитает? Сколько корма и воды можно давать в день? Её поведение - это норма? Ответы на все эти вопрося знает наш мный дом.',
        "price": '94',
        "src": '../global-images/for-cards/smart-house-for-fennec-2.jpeg',
        "cardRating": '4.1',
        "category": ["unique"],
        "id": '153',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная лежанка для минипига "Пигамбия"',
        "description": 'Свиньи — любопытные животные, которым нравится среда, в которой они могут исследовать свое окружение. Игрушки и обогащение жизненно необходимы для того, чтобы мини-свиньи были счастливы. Обогащение, место для исследования снов и отдыха - это лежанка "Пигамбия".',
        "price": '114',
        "src": '../global-images/for-cards/smart-bed-for-miniature-pigs.jpeg',
        "cardRating": '3.1',
        "category": ["unique"],
        "id": '154',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная лежанка для минипига "Свиноградик"',
        "description": 'Вы знали, что температура замерзания воды убивает зелёные побеги винограда? Для минипигов также нехорошо находиться на холоде. Чтобы ваши свинки не замёрзли и, при этом не оказались на диване, мы создали лежанку для свиней "Свиноградник".',
        "price": '118',
        "src": '../global-images/for-cards/smart-bed-for-miniature-pigs-1.jpeg',
        "cardRating": '4.1',
        "category": ["unique"],
        "id": '155',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умная лежанка для минипига "Пиггл-домик"',
        "description": 'В "Пиггл-домик" мы уже удовлетворили потребности вашего мини-питомца в тепле и уюте. Самообогревающаяся лежанка не даст замёрзнуть питомцу даже если дом по каким-то причинам не отапливается. Даже в самую холодную температуру дома вашей свинке будет тепло и комфортно.',
        "price": '122',
        "src": '../global-images/for-cards/smart-bed-for-miniature-pigs-2.jpeg',
        "cardRating": '5.0',
        "category": ["unique"],
        "id": '156',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный аквариум для аксолотля "Аксолитрон"',
        "description": 'Аксолотли — это такие волшебные существа, которым, похоже, удалось открыть секрет вечной молодости: являясь по сути своей личинками, то есть младенцами загадочного мира земноводных, многие в этом младенческом состоянии так всю жизнь и пребывают. Теперь они живут у вас.',
        "price": '132',
        "src": '../global-images/for-cards/smart-aquarium-for-axolotls.jpeg',
        "cardRating": '3.1',
        "category": ["unique"],
        "id": '157',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный аквариум для аксолотля "ЛотлиБот"',
        "description": 'Его фирменная «улыбка» и по-настоящему уникальный внешний вид сделали эту амфибию одним из самых популярных экзотов для домашнего содержания. Кто это? Это аксолотль. Теперь вы можете держать дома этих милашек и не беспокоиться об их здоровьи: аквариум сделает всё за вас.',
        "price": '144',
        "src": '../global-images/for-cards/smart-aquarium-for-axolotls-1.jpeg',
        "cardRating": '4.2',
        "category": ["unique"],
        "id": '158',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный аквариум для аксолотля "Аксолитек"',
        "description": 'А вы знаете, что нужно вашему домашнему питомцу? Где он живёт, чем питается, на сколько большой аквариум нужен, какая оптимальная температура ему нужна? С нашим умным аквариумом вы решаете сразу все эти вопросы, ловите все десять зайцев.',
        "price": '139',
        "src": '../global-images/for-cards/smart-aquarium-for-axolotls-2.jpg',
        "cardRating": '3.8',
        "category": ["unique"],
        "id": '159',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный аквариум для аксолотля "Генитрон"',
        "description": 'Кто может дать рекомендации по уходу за животным? Интернет интернетом, но понять причину поведения питомца всё-равно нелегко. Он ведёт себя хорошо или нехрошо? Ему комфортно или нет? Теперь в заботе об аксолотле вам поможет наш умный аквариум.',
        "price": '140',
        "src": '../global-images/for-cards/smart-aquarium-for-axolotls-3.jpeg',
        "cardRating": '4.2',
        "category": ["unique"],
        "id": '160',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный аквариум для аксолотля "Буль-буль особняк"',
        "description": '"Буль-буль особняк" точно знает все правилы по содержанию аксолотля. Этот домашний умный аквариум присмотрит за вашим питомцем, создаст ему комфортные условия для проживания и предупредит, если найдёт признаки болезни.',
        "price": '137',
        "src": '../global-images/for-cards/smart-aquarium-for-axolotls-4.jpeg',
        "cardRating": '3.4',
        "category": ["unique"],
        "id": '161',
        "numm": '0',
    },
    {
        "image": './images/black-heart.png',
        "titel": 'Умный аквариум для аксолотля "Королевство Axo"',
        "description": 'Чтобы ваш питомец был счастлив, ему нужна не только тишина, но и комфортные условия для обитания. Чтобы ваш питомец не заболел, в аквариуме всегда должны быть правильная температура, чистая вода и вовремя поданный корм. Всё это может организовать наш умный аквариум.',
        "price": '141',
        "src": '../global-images/for-cards/smart-aquarium-for-axolotls-5.jpeg',
        "cardRating": '4.3',
        "category": ["unique"],
        "id": '162',
        "numm": '0',
    },

];

let newDescription = '';
let newTitel = '';
const cardsContainer = document.querySelector('.cards');
let end = 0;
let start = 0;
let summ = 2;

let numberOfCards = [];
let loveCards = [];

items.forEach(item => {
    if (!Array.isArray(item.category)) {
        item.category = [item.category];
    }
});

// Подсчёт товаров по категориям
const allCategories = [...new Set(items.flatMap(item => item.category))];
const categoryCounts = {};

// Инициализация счётчиков
allCategories.forEach(cat => {
    categoryCounts[cat] = 0;
});

// Подсчёт по категориям
items.forEach(item => {
    item.category.forEach(cat => {
        categoryCounts[cat]++;
    });
});

// Запись значений в DOM
document.querySelector('#dog').textContent = categoryCounts.dog || 0;
document.querySelector('#cat').textContent = categoryCounts.cat || 0;
document.querySelector('#bird').textContent = categoryCounts.bird || 0;
document.querySelector('#maze').textContent = categoryCounts.maze || 0;
document.querySelector('#unique').textContent = categoryCounts.unique || 0;

let dog = []
let cat = []
let maze = []
let bird = []
let unique = []

let royalMassive = []


document.querySelector('#dog-button').addEventListener('click', (event) => {
    event.preventDefault()
    summ = 2
    document.querySelector('.cards').innerHTML = " ";
    items.forEach(item => {
        if (item.category.includes("dog")) {
            dog.push(item);
            document.querySelector('.more-cards-animals').style.display = 'flex';
            document.querySelector('.for-button-more-cards').style.display = 'none';
        }
    })
    renderCards(dog, 1)
    royalMassive = dog.map((element) => element);
})


document.querySelector('#cat-button').addEventListener('click', (event) => {
    event.preventDefault()
    summ = 2
    document.querySelector('.cards').innerHTML = " ";
    items.forEach(item => {
        if (item.category.includes("cat")) {
            cat.push(item);
            document.querySelector('.more-cards-animals').style.display = 'flex'
            document.querySelector('.for-button-more-cards').style.display = 'none';
        }

    })
    renderCards(cat, 1)
    royalMassive = cat.map((element) => element);
})


document.querySelector('#bird-button').addEventListener('click', (event) => {
    event.preventDefault()
    summ = 2
    document.querySelector('.cards').innerHTML = " ";
    items.forEach(item => {
        if (item.category.includes("bird")) {
            bird.push(item);
            document.querySelector('.more-cards-animals').style.display = 'flex';
            document.querySelector('.for-button-more-cards').style.display = 'none';
        }

    })
    renderCards(bird, 1)
    royalMassive = bird.map((element) => element);

})


document.querySelector('#maze-button').addEventListener('click', (event) => {
    event.preventDefault()
    summ = 2
    document.querySelector('.cards').innerHTML = " ";
    items.forEach(item => {
        if (item.category.includes("maze")) {
            maze.push(item);
            document.querySelector('.more-cards-animals').style.display = 'flex';
            document.querySelector('.for-button-more-cards').style.display = 'none';
        }

    })
    renderCards(maze, 1)
    royalMassive = maze.map((element) => element);
})


document.querySelector('#unique-button').addEventListener('click', (event) => {
    event.preventDefault()
    summ = 2
    document.querySelector('.cards').innerHTML = " ";
    items.forEach(item => {
        if (item.category.includes("unique")) {
            unique.push(item);
            document.querySelector('.more-cards-animals').style.display = 'flex';
            document.querySelector('.for-button-more-cards').style.display = 'none';
        }
    })
    renderCards(unique, 1)
    royalMassive = unique.map((element) => element);
})



// Главная функция отрисовки карточек
const renderCards = (items, summ) => {
    end = 16 * summ;
    start = 16 * (summ - 1);
    if (end >= items.length) {
        end = items.length
        document.querySelector('.for-button-more-cards').style.display = 'none';
        document.querySelector('.more-cards-animals').style.display = 'none';
    }
    if (window.innerWidth <= 1700) {
        end = 12 * summ;
        start = 12 * (summ - 1);
    }

    // Получаем актуальные избранные карточки
    const favorites = JSON.parse(localStorage.love || '[]');
    // кнопка купить или цифра
    const bied = JSON.parse(localStorage.buy || '[]');

    for (let i = start; i < end && i < items.length; i++) {
        // Адаптация описания и заголовка
        if (window.innerWidth <= 1200) newDescription = '';
        else if (window.innerWidth <= 1700) {
            newDescription = items[i].description.slice(0, items[i].description.indexOf('.') + 1);
            if (newDescription.length > 100) {
                newDescription = items[i].description.slice(0, 100 + (items[i].description.slice(100).indexOf(" ")));
            }
            newTitel = items[i].titel.slice(items[i].titel.indexOf('"'));
        } else {
            newTitel = items[i].titel;
            newDescription = items[i].description;
        }

        // Проверка, в избранном ли карточка
        if (favorites.some(fav => fav.id === items[i].id)) {
            items[i].image = './images/red-heart.png';
        } else {
            items[i].image = './images/black-heart.png';
        }

        // Создание HTML карточки
        let superCard = `
        <div class="card card-${items[i].id}">
            <div class="card-image">
                <div class="heart">
                    <img src="${items[i].image}" alt="#" id="heart-${items[i].id}" class="heart-${items[i].id}">
                </div>
                <img class="card-image" src="${items[i].src}" alt="card-image">
            </div>
            <div class="card-info">
                <div class="for-card-rating-back for-card-rating-back-${i}"></div>
                <div class="card-rating"><img src="./images/stars.svg" alt="#"></div>
                <h3 class="card-title">${newTitel}</h3>
                <div class="for-description for-description-${i}">
                    <p class="card-description">${newDescription}</p>
                    <button class="continue-reading continue-reading-${i}">
                        <div class="for-bt-text"><p>Читать дальше>></p></div>
                    </button>
                </div>
                <a href="#" class="item-more item-more-${i}">Узнать больше о товаре</a>
                <p class="card-price">${items[i].price} BYN</p>
            </div>
            <button class="card-button" id="card-button-${items[i].id}">Купить</button>
               <div class="summ" id="summ-${items[i].id}">
                        <button class="minus" id="minus-${items[i].id}"> - </button>
                        <span class="number" id="number-${items[i].id}">${items[i].numm}</span>
                        <button class="plus" id="plus-${items[i].id}"> + </button>
                </div>
        </div>
        `;

        cardsContainer.innerHTML += superCard;
        if (bied.some(bie => bie.id === items[i].id && bie.numm !== 0)) {
            console.log(bied.numm)
            console.log(bied[i].numm)
            document.querySelector(`#card-button-${items[i].id}`).style.display = 'none';
            document.querySelector(`#summ-${items[i].id}`).style.display = 'flex';
        } else {
            document.querySelector(`#card-button-${items[i].id}`).style.display = 'flex';
            document.querySelector(`#summ-${items[i].id}`).style.display = 'none';
        }

        if (items[i].numm !== '0') {
            document.querySelector(`#card-button-${items[i].id}`).style.display = 'none';
            document.querySelector(`#summ-${items[i].id}`).style.display = 'flex';
        } else {
            document.querySelector(`#card-button-${items[i].id}`).style.display = 'flex';
            document.querySelector(`#summ-${items[i].id}`).style.display = 'none';
        }

        // Адаптивные кнопки и описание
        if (window.innerWidth >= 1200) document.querySelector(`.continue-reading-${i}`).style.display = 'flex';
        if (window.innerWidth >= 1700) document.querySelector(`.continue-reading-${i}`).style.display = 'none';
        if (window.innerWidth <= 1200) {
            document.querySelector(`.item-more-${i}`).style.display = 'flex';
            document.querySelector(`.for-description-${i}`).style.display = 'none';
        }

        // Генерация рейтинга
        let cardInfo = document.querySelector(`.for-card-rating-back-${i}`);
        let backgroundGradient = document.createElement('div');
        let backgroundYellow = (Number(items[i].cardRating) / 5) * 100;
        let backgroundWhite = 100 - backgroundYellow;
        backgroundGradient.classList.add('card-rating-back');
        backgroundGradient.style.background = `linear-gradient(to right, rgb(250, 254, 127) ${backgroundYellow}%, white ${backgroundWhite}%)`;
        cardInfo.appendChild(backgroundGradient);
    }
};

// Клик по сердечку: добавление или удаление из избранного и корзина
cardsContainer.addEventListener('click', (event) => {
    const favorites = JSON.parse(localStorage.love || '[]');
    const bied = JSON.parse(localStorage.buy || '[]')
    for (let i = 0; i < items.length; i++) {
        if (event.target.id === `heart-${items[i].id}`) {
            const isFavorite = favorites.some(fav => fav.id === items[i].id);
            if (isFavorite) {
                // Удалить из избранного
                const updated = favorites.filter(fav => fav.id !== items[i].id);
                localStorage.love = JSON.stringify(updated);
                document.querySelector(`#heart-${items[i].id}`).src = './images/black-heart.png';
            } else {
                // Добавить в избранное
                favorites.push(items[i]);
                localStorage.love = JSON.stringify(favorites);
                document.querySelector(`#heart-${items[i].id}`).src = './images/red-heart.png';
            }
            break;
        };
        if (event.target.id === `card-button-${items[i].id}`) {
            console.log(event.target.id)
            const isBied = bied.some(bie => bie.id !== items[i].id);
            console.log(isBied)
            if (isBied) {
                // Удалить кнопку купить
                bied.push(items[i]);
                localStorage.buy = JSON.stringify(bied);
                document.querySelector(`#card-button-${items[i].id}`).style.display = 'flex';
                document.querySelector(`#summ-${items[i].id}`).style.display = 'none';
            } else {
                // Добавить кнопку купить
                const buying = bied.filter(bie => bie.id !== items[i].id);
                localStorage.buy = JSON.stringify(buying);
                document.querySelector(`#card-button-${items[i].id}`).style.display = 'none';
                document.querySelector(`#summ-${items[i].id}`).style.display = 'flex';
            }
            break;
        }
    }
});

const buyedProducts = JSON.parse(localStorage.buy || '[]');
// let redNum = JSON.parse(localStorage.numm || '[]');
// let blackNum = []
document.querySelector('.cards').addEventListener('click', (event) => {
    let reunited = [...buyedProducts];
    reunited.forEach((item) => {
        if (event.target.id === `plus-${item.id}`) {
            const numberElementic = document.querySelector(`#number-${item.id}`);
            numberElementic.textContent = Number(numberElementic.textContent) + 1;
        }
        if (event.target.id === `minus-${item.id}`) {
            const numberElementic = document.querySelector(`#number-${item.id}`);
            numberElementic.textContent = Math.max(0, Number(numberElementic.textContent) - 1);
        }
    });
});

// Кнопка "показать больше"
document.querySelector('.more-cards').addEventListener('click', () => {
    summ++;
    renderCards(items, summ);
});

let categoryBut = document.querySelector('.more-cards-animals');

categoryBut.addEventListener('click', () => {
    renderCards(royalMassive, summ);
    summ++

})

renderCards(items, 1);
